_posts/2017-11-03-LSTM-colah's-blog-review.html
---
layout: default
title: "Using org-mode with Jekyll"
permalink: /:title/
tags: hacking
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">实验</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>exclude org
</li>
<li>输出是post文件夹
</li>
<li>不使用 export
可以识别page, title, 无法识别内容
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">实验2</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>使用export, P, f
exclude没有生效, 效果和不使用export是一样的.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">实验3</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>使用绝对路径替换org
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">实验4</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>无法阻止生成两个, 无法阻止org
</li>
<li>使用对org下划线,成功.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">实验5</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>如何做到识别layout?
</li>
<li>add the header to try
添加
<div class="org-src-container">

<pre class="src src-html">#+OPTIONS: toc:nil num:nil
#+BEGIN_HTML
---
layout: post
title: "Using org-mode with Jekyll"
permalink: /:title/
tags: hacking
---
#+END_HTML
</pre>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Hello World!</h2>
<div class="outline-text-2" id="text-6">
<p>
This is the index page
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><a href="http://colah.github.io/posts/2015-08-Understanding-LSTMs">LSTM description blog</a></h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="todo TODO">TODO</span> cell state , it is common for every LSTM or not?</h2>
<div class="outline-text-2" id="text-8">
<p>
state is the unique sturcture in LSTM, as the RNN sturcture don't have such kind of 'state cell'.
</p>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="todo TODO">TODO</span> test latex with github pages</h2>
<div class="outline-text-2" id="text-9">
<p>
\[\theta^{100}\]
</p>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">steps to test github-blog with org mode</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>org mode official website of how to build org into jekyll
<a href="http://orgmode.org/worg/org-tutorials/org-jekyll.html">Using org to blog with jekyll</a>
</li>
<li>steps to install
install jekyll.
the main idea of the mechanism is the usage of org to produce &lt;body&gt; and jekyll to produce the rest.
</li>
<li>steps to configure
</li>
<li></li>
</ol>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="todo TODO">TODO</span> can i define the head of the org file using html export headings.</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>like only body ture
</li>
<li></li>
</ol>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="todo TODO">TODO</span> test images</h2>
<div class="outline-text-2" id="text-12">
<p>
using images file to include images
use link insert with file name only as the links local files.
</p>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="todo TODO">TODO</span> test latex</h2>
<div class="outline-text-2" id="text-13">
<p>
export latex
</p>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="todo TODO">TODO</span> test html change</h2>
<div class="outline-text-2" id="text-14">
<p>
using directly the html change settings to export html.
</p>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="done DONE">DONE</span> links local files</h2>
<div class="outline-text-2" id="text-15">
<p>
do not use the absolute directory
use the file name <a href="name.html">remember</a>
</p>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="todo TODO">TODO</span> set org-publish-project-alist</h2>
<div class="outline-text-2" id="text-16">
<ol class="org-ol">
<li>org -&gt; html
</li>
<li>images, scipts -&gt; html
</li>
<li>execute the iamges and scripts.
</li>
</ol>
</div>
<div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1">This is the org file.</h3>
<div class="outline-text-3" id="text-16-1">
<ol class="org-ol">
<li>Change the org file without export to project.
the two file will change together. That's too strange.
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">Test whether it is the reason of post layout.</h2>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">two files together i can;t figure out where it comes from.</h2>
</div>
